## Preview of Terragrunt changes in 7bb4d77940bf58bb859b829dd9f05a9d11dfcd1b

### Changed Stacks

```bash
non-prod/westeurope/qa/mi-2
```

#### Terragrunt Plan

```terraform
terramate: Entering stack in /non-prod/westeurope/qa/mi-2
terramate: Executing command "terragrunt show out.tfplan"
[1;31m----------

NOTICE:

You have tried to upgrade to asdf 0.16.0 or newer. Versions 0.16.0 is a
complete rewrite of asdf in Go. This text is being printed by the older
Bash implementation. If you are seeing this you have not migrated to
asdf 0.16.0. Please follow the instructions on the upgrade guide to
migrate to the new version.

Aside from this notice, this older Bash implementation works as it did
in asdf version 0.15.0 and older.

Migration guide: https://asdf-vm.com/guide/upgrading-to-v0-16
asdf website: https://asdf-vm.com
Source code: https://github.com/asdf-vm/asdf
[0m

[1;31m----------

NOTICE:

You have tried to upgrade to asdf 0.16.0 or newer. Versions 0.16.0 is a
complete rewrite of asdf in Go. This text is being printed by the older
Bash implementation. If you are seeing this you have not migrated to
asdf 0.16.0. Please follow the instructions on the upgrade guide to
migrate to the new version.

Aside from this notice, this older Bash implementation works as it did
in asdf version 0.15.0 and older.

Migration guide: https://asdf-vm.com/guide/upgrading-to-v0-16
asdf website: https://asdf-vm.com
Source code: https://github.com/asdf-vm/asdf
[0m


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # azurerm_user_assigned_identity.self[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_user_assigned_identity" "self" {
      [33m~[0m[0m client_id           = "4532b8bb-dde2-4559-abd3-95712b51e84b" -> (known after apply)
      [33m~[0m[0m id                  = "/subscriptions/77210ef6-94c3-4d09-97f2-082a15991b08/resourceGroups/lab-access-frameowrk/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-nocloud-cebolas" -> (known after apply)
      [33m~[0m[0m name                = "mi-nocloud-cebolas" [33m->[0m[0m "mi-nocloud-plantas" [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_id        = "44ac361a-205b-4f02-ab22-ee97904dcc17" -> (known after apply)
        tags                = {
            "XP_Owner"   = "daniel.barradas@xpand-it.com"
            "XP_Project" = "DATASUPPORT"
        }
      [33m~[0m[0m tenant_id           = "d6116112-786c-4102-8fa9-ed8eceb61a77" -> (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m
Changes to Outputs:
  [33m~[0m[0m client_id    = "4532b8bb-dde2-4559-abd3-95712b51e84b" -> (known after apply)
  [33m~[0m[0m id           = "/subscriptions/77210ef6-94c3-4d09-97f2-082a15991b08/resourceGroups/lab-access-frameowrk/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mi-nocloud-cebolas" -> (known after apply)
  [33m~[0m[0m name         = "mi-nocloud-cebolas" [33m->[0m[0m "mi-nocloud-plantas"
  [33m~[0m[0m principal_id = "44ac361a-205b-4f02-ab22-ee97904dcc17" -> (known after apply)
  [33m~[0m[0m tenant_id    = "d6116112-786c-4102-8fa9-ed8eceb61a77" -> (known after apply)
```

<!-- Sticky Pull Request Commentpreview -->